applications/test/faMesh/cavity/constant/faMesh/faBoundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2202                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       faBoundaryMesh;
    location    "constant/faMesh";
    object      faBoundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    movingWall
    {
        type            patch;
        ngbPolyPatchIndex 0;
        edgeLabels      List<label> 2(8 13);
    }
    empty
    {
        type            empty;
        inGroups        1(empty);
        ngbPolyPatchIndex -1;
        edgeLabels      List<label> 
12
(
5
6
7
9
10
11
12
14
15
16
17
18
)
;
    }
)

// ************************************************************************* //
