applications/test/faMesh/cavity/system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    ddt(h,Us)           Euler;
    ddt(h)              Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default             none;
    div(phis,h)         Gauss Gamma 0.5;
    div(phi2s,Us)       Gauss linearUpwind;
}

laplacianSchemes
{
    default             none;
    laplacian(h)        Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             corrected;
}


// ************************************************************************* //
